export const TOPICS = {
    python: [
        { id: 'Синтаксис', name: 'Синтаксис', icon: '🔹', minGrade: 1 },
        { id: 'Циклы', name: 'Циклы', icon: '🔄', minGrade: 5 },
        { id: 'ООП', name: 'ООП', icon: '📦', minGrade: 9 },
        { id: 'Алгоритмы', name: 'Алгоритмы', icon: '⚙️', minGrade: 8 }
    ],
    math: [
        { id: 'Арифметика', name: 'Арифметика', icon: '➕', minGrade: 1 },
        { id: 'Алгебра', name: 'Алгебра', icon: '📐', minGrade: 7 },
        { id: 'Геометрия', name: 'Геометрия', icon: '🔵', minGrade: 7 },
        { id: 'Стереометрия', name: 'Стереометрия', icon: '🧊', minGrade: 10 }
    ]
};